
#  Do sequels earn more?

##  Assignment 

It is time to put together many of the aspects that you have learned in this chapter. In this exercise, you'll find out which movie sequels earned the most compared to the original movie. To answer this question, you will merge a modified version of the `sequels` and `financials` tables where their index is the movie ID. You will need to choose a merge type that will return all of the rows from the `sequels` table and not all the rows of `financials` table need to be included in the result. From there, you will join the resulting table to itself so that you can compare the revenue values of the original movie to the sequel. Next, you will calculate the difference between the two revenues and sort the resulting dataset. 

The `sequels` and `financials` tables have been provided.

##  Pre exercise code 

```
from pickle import load
import urllib.request
import pandas as pd

fn_seq = 'https://assets.datacamp.com/production/repositories/5486/datasets/4072d8a5a94dcf0a537bdcf01032bd0677ada85b/sequels.p'
fn_fin = 'https://assets.datacamp.com/production/repositories/5486/datasets/e8f6bb0393b96bad22d50e42d5a9db1bbb643aa8/financials.p'

# The id must be set with string dtype otherwise an error
sequels = load(urllib.request.urlopen(fn_seq))
sequels = sequels.astype({'id':'str', 'sequel':'str'})
sequels = sequels.set_index('id')

financials = load(urllib.request.urlopen(fn_fin))
financials = financials.astype({'id':'str'})
financials = financials.set_index('id')
```

In [91]:
from pickle import load
import urllib.request
import pandas as pd

In [92]:
fn_seq = 'https://assets.datacamp.com/production/repositories/5486/datasets/4072d8a5a94dcf0a537bdcf01032bd0677ada85b/sequels.p'
fn_fin = 'https://assets.datacamp.com/production/repositories/5486/datasets/e8f6bb0393b96bad22d50e42d5a9db1bbb643aa8/financials.p'

In [93]:
# The id must be set with string dtype otherwise an error
sequels = load(urllib.request.urlopen(fn_seq))
sequels = sequels.astype({'id':'str', 'sequel':'str'})
sequels = sequels.set_index('id')

In [94]:
financials = load(urllib.request.urlopen(fn_fin))
financials = financials.astype({'id':'str'})
financials = financials.set_index('id')

In [95]:
sequels.head(1)

        title sequel
id
19995  Avatar   <NA>

In [96]:
financials.head(1)

          budget       revenue
id
19995  237000000  2.787965e+09

##  Instructions 

- With the `sequels` table on the left, merge to it the `financials` table on index named `id`, ensuring that all the rows from the `sequels` are returned and some rows from the other table may not be returned, Save the results to `sequels_fin`.

In [99]:
sequels_fin = sequels.merge(financials, on="id", how="left")

In [100]:
print("seq", sequels.shape, sep=": ")
print("fin", financials.shape, sep=": ")
print("seq_fin", sequels_fin.shape, sep=": ")

seq: (4803, 2)
fin: (3229, 2)
seq_fin: (4803, 4)

In [101]:
sequels_fin.head()

              title sequel       budget       revenue
id
19995        Avatar   <NA>  237000000.0  2.787965e+09
862       Toy Story    863   30000000.0  3.735540e+08
863     Toy Story 2  10193   90000000.0  4.973669e+08
597         Titanic   <NA>  200000000.0  1.845034e+09
24428  The Avengers   <NA>  220000000.0  1.519558e+09

- Merge the `sequels_fin` table to itself with an inner join, where the left and right tables merge on `sequel` and `id` respectively with suffixes equal to `('_org','_seq')`, saving to `orig_seq`.

In [109]:
orig_seq = sequels_fin.merge(sequels_fin, left_on="sequel", right_on="id", suffixes=["_org", "_seq"])

In [110]:
orig_seq.head()

,title_org,sequel_org,budget_org,revenue_org,title_seq,sequel_seq,budget_seq,revenue_seq
0,Toy Story,863,30000000.0,373554033.0,Toy Story 2,10193,90000000.0,4.973669e+08
1,Toy Story 2,10193,90000000.0,497366869.0,Toy Story 3,<NA>,200000000.0,1.066970e+09
2,Harry Potter and the Order of the Phoenix,767,150000000.0,938212738.0,Harry Potter and the Half-Blood Prince,<NA>,250000000.0,9.339592e+08
3,The Lord of the Rings: The Two Towers,122,79000000.0,926287400.0,The Lord of the Rings: The Return of the King,<NA>,94000000.0,1.118889e+09
4,The Lord of the Rings: The Fellowship of the Ring,121,93000000.0,871368364.0,The Lord of the Rings: The Two Towers,122,79000000.0,9.262874e+08

In [111]:
orig_seq['diff'] = orig_seq['revenue_seq'] - orig_seq['revenue_org']

In [112]:
orig_seq.head()

,title_org,sequel_org,budget_org,revenue_org,title_seq,sequel_seq,budget_seq,revenue_seq,diff
0,Toy Story,863,30000000.0,373554033.0,Toy Story 2,10193,90000000.0,4.973669e+08,123812836.0
1,Toy Story 2,10193,90000000.0,497366869.0,Toy Story 3,<NA>,200000000.0,1.066970e+09,569602834.0
2,Harry Potter and the Order of the Phoenix,767,150000000.0,938212738.0,Harry Potter and the Half-Blood Prince,<NA>,250000000.0,9.339592e+08,-4253541.0
3,The Lord of the Rings: The Two Towers,122,79000000.0,926287400.0,The Lord of the Rings: The Return of the King,<NA>,94000000.0,1.118889e+09,192601579.0
4,The Lord of the Rings: The Fellowship of the Ring,121,93000000.0,871368364.0,The Lord of the Rings: The Two Towers,122,79000000.0,9.262874e+08,54919036.0

- Select the `title_org`, `title_seq`, and `diff` columns of `orig_seq` and save this as `titles_diff`.

In [113]:
titles_diff = orig_seq[["title_org", "title_seq", "diff"]]

In [114]:
titles_diff.head()

,title_org,title_seq,diff
0,Toy Story,Toy Story 2,123812836.0
1,Toy Story 2,Toy Story 3,569602834.0
2,Harry Potter and the Order of the Phoenix,Harry Potter and the Half-Blood Prince,-4253541.0
3,The Lord of the Rings: The Two Towers,The Lord of the Rings: The Return of the King,192601579.0
4,The Lord of the Rings: The Fellowship of the Ring,The Lord of the Rings: The Two Towers,54919036.0

- Sort by `titles_diff` by `diff` in descending order and print the first few rows.

In [115]:
titles_diff.sort_values("diff", ascending=False).head()

            title_org        title_seq          diff
28  Jurassic Park III   Jurassic World  1.144748e+09
26      Batman Begins  The Dark Knight  6.303398e+08
11         Iron Man 2       Iron Man 3  5.915067e+08
1         Toy Story 2      Toy Story 3  5.696028e+08
14  Quantum of Solace          Skyfall  5.224703e+08